Catalogs/ПрограммыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ПрограммыКредитования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Банки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИпотечныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИпотечныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаУсловийСтавок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыУсловийСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУсловияПримененияСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУсловияПримененияСтавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УсловияПримененияСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УсловияПримененияСтавок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИпотечныеСтавки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУсловияПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловияПримененияСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыУсловийСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСтавок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПрограммыКредитования/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//&НаКлиенте
//Перем Расположения, Красный, Зеленый;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Схемы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	ДатаСреза = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СхемыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("НарисоватьСхему", 0.5,Истина);
КонецПроцедуры

&НаКлиенте
Процедура НарисоватьСхему()
	
	ТекущаяСхема =  Элементы.Схемы.ТекущиеДанные;
	
	Если ТекущаяСхема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Схема = ТекущаяСхема.Ссылка;
	
	
	//Документы.УсловияПримененияСтавок.ЗаполнитьТабДокПоСхеме(Схема, ТабДок, Расположения);
	
	ПолучениеСхемыНаСервере(Схема);
	

	ОбновитьОтборы(Схема);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеСхемыНаСервере(Схема)
	ТабДок = Новый ТабличныйДокумент;
	
	ТД.Очистить();
	Документы.УсловияПримененияСтавок.ЗаполнитьТабДокПоСхеме(Схема, ТабДок, Расположения);
	Документы.УсловияПримененияСтавок.ОтобразитьЗначенияВТабДоке(Схема, ТабДок, Расположения, ДатаСреза);
	ТД.Вывести(ТабДок);
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборы(Схема) Экспорт
	
	Отборы.Настройки.Отбор.Элементы.Очистить();

	СКД = Справочники.СхемыУсловийСтавки.СоздатьСхемуКомпоновкиОтборы();
	
	АдресСхемыКомпоновкиДоступнныеПоля = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	ИсточникНастроекДоступнныеПоля = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДоступнныеПоля);
	Отборы.Инициализировать(ИсточникНастроекДоступнныеПоля);
	НастройкиКомпоновкиДанных = Неопределено;
	
	НастройкиКомпоновкиДанных = Справочники.СхемыУсловийСтавки.ПолучитьНастройкиКомпоновкиДанныхОтборы(Схема);
	
	
	Если НЕ НастройкиКомпоновкиДанных = Неопределено Тогда
		Отборы.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСрезаПриИзменении(Элемент)
	НарисоватьСхему();
	РаскраситьГруппуПериодаДействия();
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Схема = Элементы.Схемы.ТекущиеДанные.Ссылка;
	СуществующийДокумент = НайтиСуществующийДокумент(ДатаСреза, Схема);
	Если СуществующийДокумент<> Неопределено Тогда
		ОткрытьЗначение(СуществующийДокумент);
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Схема, ВидОперации, Дата", Схема, ПредопределенноеЗначение("Перечисление.ВидыОперацийУсловияПримененияСтавок.Установка"), ДатаСреза); 
	Форма = ПолучитьФорму("Документ.УсловияПримененияСтавок.Форма.ФормаДокумента",ПараметрыФормы);
	Форма.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСуществующийДокумент(ДатаРегистрации, Схема)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИпотечныеСтавки.Регистратор
		|ИЗ
		|	РегистрСведений.ИпотечныеСтавки КАК ИпотечныеСтавки
		|ГДЕ
		|	ИпотечныеСтавки.Период = &ДатаРегистрации
		|	И ИпотечныеСтавки.СхемаУсловийСтавок = &Схема
		|	И ИпотечныеСтавки.Активен";
	
	Запрос.УстановитьПараметр("ДатаРегистрации", ДатаРегистрации);
	Запрос.УстановитьПараметр("Схема", Схема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	КонецЦикла;
		
КонецФункции


&НаКлиенте
Процедура Отменить(Команда)
	ПараметрыФормы = Новый Структура("Схема, ВидОперации, Дата",Элементы.Схемы.ТекущиеДанные.Ссылка, ПредопределенноеЗначение("Перечисление.ВидыОперацийУсловияПримененияСтавок.Отмена"), ДатаСреза); 
	Форма = ПолучитьФорму("Документ.УсловияПримененияСтавок.Форма.ФормаДокумента",ПараметрыФормы);
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ТекущаяСхема =  Элементы.Схемы.ТекущиеДанные;
	
	Если ТекущаяСхема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСхема = ТекущаяСхема.Ссылка;

	Если ИмяСобытия = "УсловияПримененияСтавокИзменение" И Параметр = ТекущаяСхема Тогда
		 НарисоватьСхему();
	 ИначеЕсли ИмяСобытия = "ЗаписьСхемыУсловийСтавки"  И Параметр = ТекущаяСхема Тогда
		 НарисоватьСхему();
		 ОбновитьОтборы(ТекущаяСхема);
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура РаскраситьГруппуПериодаДействия()
	ТекДата = ДатаСреза;
	Если ТекДата >=Объект.НачалоДействия И ТекДата <= Объект.ОкончаниеДействия Тогда
		Элементы.ГруппаПериодДействия.ЦветФона = Зеленый;
	Иначе
		Элементы.ГруппаПериодДействия.ЦветФона = Красный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределитьВидимостьЭлементов();
	РаскраситьГруппуПериодаДействия();
КонецПроцедуры

&НаКлиенте
Процедура НачалоДействияПриИзменении(Элемент)
	РаскраситьГруппуПериодаДействия();
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияПриИзменении(Элемент)
	Если Объект.ОкончаниеДействия < Объект.НачалоДействия Тогда
		Объект.ОкончаниеДействия = '00010101';
		Сообщить("Дата окончания не может быть меньше даты начала действия!");
	КонецЕсли;
	
	РаскраситьГруппуПериодаДействия();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСхему(Команда)
	Форма = ПолучитьФорму("Справочник.СхемыУсловийСтавки.Форма.ФормаЭлемента", Новый Структура("Владелец",Объект.Ссылка));
	Форма.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура БессрочнаяПриИзменении(Элемент)
	Если Объект.Бессрочная Тогда
		Объект.ОкончаниеДействия = '39991231';
	Иначе
		Объект.ОкончаниеДействия = '00010101';
	КонецЕсли;
	ОпределитьВидимостьЭлементов();
	РаскраситьГруппуПериодаДействия();

КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВидимостьЭлементов()
	
		Элементы.ОкончаниеДействия.Видимость = НЕ Объект.Бессрочная;
	
КонецПроцедуры

Красный = Новый Цвет(255, 204, 153); 
Зеленый = Новый Цвет(204, 255, 204);
